package com.kh.finalprj.dto;

import java.sql.Timestamp;

import lombok.Data;

@Data
public class NoteSearchDto {

    // ========================================
    // 노트 번호
    // ========================================

    private int noteNo;


    // ========================================
    // 프로젝트 번호
    // ========================================

    private int projectNo;


    // ========================================
    // 프로젝트 이름
    // ========================================

    private String projectName;


    // ========================================
    // 작성자
    // ========================================

    private int noteWriterNo;

    private int writerEmpNo;

    private String writerName;


    // ========================================
    // 노트 제목
    // ========================================

    private String noteTitle;


    // ========================================
    // 노트 내용
    // ========================================

    private String noteContent;


    // ========================================
    // 생성일
    // ========================================

    private Timestamp noteCtime;


    // ========================================
    // 수정일
    // ========================================

    private Timestamp noteUtime;

}